using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Console_educational_project
{
    public class ListTasks
    {
        /*
          Задание 1: «Система логирования» 
        Цель: Научиться создавать список, добавлять (Add), удалять (Remove) элементы и проверять их наличие (Contains).
        Текст задания:Ты пишешь модуль безопасности для сервера. 
        Сервер записывает события (логи) в список строк List<string> serverLogs.

        Добавь в список три записи: "Пользователь вошел", "Ошибка подключения к БД", "Файл скачан".
        Выведи в консоль общее количество записанных логов (используй свойство .Count).
        Представим, что ошибку подключения исправили, поэтому удали запись "Ошибка подключения к БД" из списка.
        Проверь с помощью .Contains(), осталась ли в списке запись "Пользователь вошел". 
        Если да, выведи в консоль: "Сессия активна".
         */

    }
}
